Экран редактирования заметки находится в NoteEdit.storyboard (с контроллером NoteEditViewController.swift). Чтобы перейти на него в приложении, есть кнопка Edit Note на главном экране.

Элемент выбора цвета в виде квадратиков реализован с помощью отдельного компонента ColorSelectorView.swift, который внутри себя использует компонент ColorItemView.swift (отдельный квадрат с цветом, в котором также происходит рисование флажка).

Элемент выбора цвета из палитры реализован с помощью отдельного компонента ColorPickerView.swift и для него также требуются файлы ColorFieldView.swift (непосредственно сама палитра) и SelectedColorView.swift (элемент, отображающий текущий цвет).

Для элементов также требуется файл CGFloatExtension.swift в папке Model. В нем содержится функция для преобразования градусов в радианы.